from django import template
register = template.Library()

@register.filter
def yemen_word(value):
    if not isinstance(value, str):
        return value
    word_yemena_ = {
        "بيت": "دار",
        "فطار": "بدءء",
        "نقاب": "برقع",
        "انتظر": "هنج",
        "تنتظر":"تهنج",
        "مجلس": "ديوان",
        "مطبخ": "سقيفه",
        "انظر": "تأمل",
        "شوف": "عيًًن",
        "ماذا":"مو",
        "تريد":"ارك",
        "فلوس":"بيس",
        "اذهب":"سير",
        "سريع":"فيسع",
        "تحدث":"اهدر",
        "تكلم":"تخابر",
        "ارجوك":"يامنعاه",
        "قفل":"رزح",
        "كثير":"فعلة",
        "نوم":"راقد",
        "يبتسم":"مقعي",
        "شارد":"سارح",
        "يتباهي":"يفصع",
        "جميل":"تحيف",
        "فتاة":"بنية",
        "طاولة":"ماسة",
        "ضحك":"قعي",
        "براية":"مقشطة",
        "ويحك":"ياويلك يا سواد ليلك",
        "إهدا":"قر",
        "اصمت":"اصه",
        "ملل":"طفش",
        "تريد":"تشتي",
        "دقيق":"بر",
        "يوجد":"به",
        "نقدم":"نضمد",
        "اريد":"اشتيني",
        "اكره":"اشقر",
        "يلا":"ناهي",
        "محواش":"مشجنة",
        "قطة":"عسلانة",
        "لاتقلق":"سعليك",
        "ليش":"لموه",
        "مكرونة":"رز مطولل",
        "الطفل":"الجاهل",
        "تحمل":"تشل",
        "تقول":"نهدر",
        "هل":"عا",
        "يمكنك":"تقدر",
    }
    for word, word_y in word_yemena_.items():
        value = value.replace(word, word_y)
    return value
